/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   fr_help.c                                          :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: fsmith <fsmith@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2019/07/17 21:15:17 by fsmith            #+#    #+#             */
/*   Updated: 2019/07/17 21:16:12 by fsmith           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "../includes/fr_fractol.h"

/*
 * q - рандомные цвета
 * w - радуга
 * e - перелив кривой
 * r - следующий рандомный фрактал
 * t - правильный градиент
 * space - в центр
 *
 */